app/Controllers/Admin/Agencies.php

SELECT *
FROM `agencies`
WHERE `agencies`.`id` = '12'
SELECT `users`.*, `roles`.`display_name` as `role_name`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`agency_id` = '12'
SELECT `properties`.*, `zones`.`name` as `zone_name`, `users`.`first_name` as `agent_name`, `users`.`last_name` as `agent_lastname`
FROM `properties`
LEFT JOIN `zones` ON `zones`.`id` = `properties`.`zone_id`
LEFT JOIN `users` ON `users`.`id` = `properties`.`agent_id`
WHERE `properties`.`agency_id` = '12'
ORDER BY `properties`.`created_at` DESC
SELECT `clients`.*, `users`.`first_name` as `agent_name`, `users`.`last_name` as `agent_lastname`
FROM `clients`
LEFT JOIN `users` ON `users`.`id` = `clients`.`assigned_to`
WHERE `clients`.`agency_id` = '12'
ORDER BY `clients`.`created_at` DESC
SELECT `transactions`.*, `properties`.`title` as `property_title`, `properties`.`reference` as `property_ref`, CONCAT(client.first_name, " ", client.last_name) as client_name, CONCAT(agent.first_name, " ", agent.last_name) as agent_name
FROM `transactions`
LEFT JOIN `properties` ON `properties`.`id` = `transactions`.`property_id`
LEFT JOIN `clients` as `client` ON `client`.`id` = `transactions`.`client_id`
LEFT JOIN `users` as `agent` ON `agent`.`id` = `transactions`.`agent_id`
WHERE `transactions`.`agency_id` = '12'
ORDER BY `transactions`.`created_at` DESC
SELECT *
FROM `agencies`
WHERE `parent_id` = '12'
---
    public function view($id)
    {
        $agency = $this->agencyModel->find($id);

        if (!$agency) {
            return redirect()->to(base_url('admin/agencies'))->with('error', 'Agence introuvable');
        }

        // Get agency data with details
        $userModel = model('UserModel');
        $propertyModel = model('PropertyModel');
        $clientModel = model('ClientModel');
        $transactionModel = model('TransactionModel');

        $data = [
            'title' => 'Détails Agence - ' . $agency['name'],
            'agency' => $agency,
            'users' => $userModel->select('users.*, roles.display_name as role_name')
                ->join('roles', 'roles.id = users.role_id', 'left')
                ->where('users.agency_id', $id)
                ->findAll(),
            'properties' => $propertyModel->select('properties.*, zones.name as zone_name, users.first_name as agent_name, users.last_name as agent_lastname')
                ->join('zones', 'zones.id = properties.zone_id', 'left')
                ->join('users', 'users.id = properties.agent_id', 'left')
                ->where('properties.agency_id', $id)
                ->orderBy('properties.created_at', 'DESC')
                ->findAll(),
            'clients' => $clientModel->select('clients.*, users.first_name as agent_name, users.last_name as agent_lastname')
                ->join('users', 'users.id = clients.assigned_to', 'left')
                ->where('clients.agency_id', $id)
                ->orderBy('clients.created_at', 'DESC')
                ->findAll(),
            'transactions' => $transactionModel->select('transactions.*, properties.title as property_title, properties.reference as property_ref,
                CONCAT(client.first_name, " ", client.last_name) as client_name,
                CONCAT(agent.first_name, " ", agent.last_name) as agent_name')
                ->join('properties', 'properties.id = transactions.property_id', 'left')
                ->join('clients as client', 'client.id = transactions.client_id', 'left')
                ->join('users as agent', 'agent.id = transactions.agent_id', 'left')
                ->where('transactions.agency_id', $id)
                ->orderBy('transactions.created_at', 'DESC')
                ->findAll(),
            'subAgencies' => $this->agencyModel->where('parent_id', $id)->findAll()