app/Controllers/Admin/Roles.php

SELECT *
FROM `roles`
ORDER BY `level` ASC
SELECT *
FROM `role_permissions`
WHERE `role_id` = '7'
---
    public function matrix()
    {
        $roles = $this->roleModel->orderBy('level', 'ASC')->findAll();
        $modules = $this->getAvailableModules();

        // Récupérer toutes les permissions par rôle
        $permissionsMatrix = [];
        foreach ($roles as $role) {
            $rolePerms = $this->db->table('role_permissions')
                ->where('role_id', $role['id'])
                ->get()
                ->getResultArray();

SELECT *
FROM `permissions`
ORDER BY `module` ASC, `name` ASC
---
    private function getAvailableModules()
    {
        $permissions = $this->permissionModel->orderBy('module', 'ASC')->orderBy('name', 'ASC')->findAll();