app/Models/NotificationModel.php

    public function getRecent(int $userId, int $limit = 8): array
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC

    public function countUnread(int $userId): int
    {
        return (int) $this->where('user_id', $userId)
                          ->where('is_read', 0)
                          ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '2'
AND `is_read` = 0