app/Models/SettingModel.php

SELECT *
FROM `settings`
WHERE `key_name` = 'primary_color'
 LIMIT 1
---
    public function get($key, $default = null)
    {
        $setting = $this->where('key_name', $key)->first();