app/Models/UserModel.php

    public function getUserWithRoles($userId)
    {
        $db = \Config\Database::connect();

        $user = $this->find($userId);
        if (!$user) {
            return null;
        }

        // Get all roles for this user
        $userRoles = $db->table('user_roles')
            ->select('user_roles.*, roles.name, roles.display_name, roles.level')
            ->join('roles', 'roles.id = user_roles.role_id')
            ->where('user_roles.user_id', $userId)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT `user_roles`.*, `roles`.`name`, `roles`.`display_name`, `roles`.`level`
FROM `user_roles`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`user_id` = '2'

    public function getActiveRole($userId)
    {
        $db = \Config\Database::connect();

        return $db->table('user_roles')
            ->select('user_roles.*, roles.name, roles.display_name, roles.level')
            ->join('roles', 'roles.id = user_roles.role_id')
            ->where('user_roles.user_id', $userId)
            ->where('user_roles.is_active', 1)
            ->get()
            ->getRowArray();
---
SELECT `user_roles`.*, `roles`.`name`, `roles`.`display_name`, `roles`.`level`
FROM `user_roles`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`user_id` = '2'
AND `user_roles`.`is_active` = 1